# Using multivariable regression technique to estimate the values

In [ ]:
import pandas as pd
import numpy as np 
from sklearn import linear_model
df=pd.read_csv("homeprices.csv")

### There is a nan value in the dataframe

In [2]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [11]:
k=df["bedrooms"].median()

In [8]:
import math
math.ceil(df["bedrooms"].median())

4

In [13]:
df["bedrooms"]=df["bedrooms"].fillna(k)

### The nan value is removed using the median of the series bedrooms

In [14]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [15]:
reg=linear_model.LinearRegression()

In [16]:
reg.fit(df[["area","bedrooms","age"]],df[["price"]])
reg.predict([[2400,4,32]])

C:\Users\pteja\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[480413.40976203]])

### A new dataset is imported and data preprocessing is done and multivariable linear regression is performed

In [17]:
df2=pd.read_csv("hiring.csv")

In [18]:
df2

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [22]:
df2["experience"]=df2["experience"].fillna(0).astype(str)

### Word2number module is used to convert string numbers to int values one must ensure there are no

In [27]:
df2
from word2number import w2n

In [28]:
df2["experience"]=df2.experience.apply(w2n.word_to_num)

In [29]:
df2

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [33]:
df2.rename(columns={"interview_score(out of 10)":"intscore","test_score(out of 10)":"testscore"},inplace=True)
df2

   experience  testscore  intscore  salary($)
0           0        8.0         9      50000
1           0        8.0         6      45000
2           5        6.0         7      60000
3           2       10.0        10      65000
4           7        9.0         6      70000
5           3        7.0        10      62000
6          10        NaN         7      72000
7          11        7.0         8      80000

In [37]:
df2["testscore"].fillna(math.floor(df2["testscore"].median()),inplace=True)

In [38]:
df2

   experience  testscore  intscore  salary($)
0           0        8.0         9      50000
1           0        8.0         6      45000
2           5        6.0         7      60000
3           2       10.0        10      65000
4           7        9.0         6      70000
5           3        7.0        10      62000
6          10        8.0         7      72000
7          11        7.0         8      80000

In [39]:
reg2=linear_model.LinearRegression()
reg2.fit(df2[["experience","testscore","intscore",]],df2[["salary($)"]])
reg2.predict([[1,10,10]])

C:\Users\pteja\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[61059.6797671]])